In [42]:
import numpy as np
import pandas as pd
import scipy.stats as st

from scipy.stats import norm

In [78]:
df = pd.read_csv('work/hse/applied_stats/week1/water.txt', sep='\t')
df

   location           town  mortality  hardness
0     South           Bath       1247       105
1     North     Birkenhead       1668        17
2     South     Birmingham       1466         5
3     North      Blackburn       1800        14
4     North      Blackpool       1609        18
..      ...            ...        ...       ...
56    South        Walsall       1527        60
57    South  West Bromwich       1627        53
58    South       West Ham       1486       122
59    South  Wolverhampton       1485        81
60    North           York       1378        71

[61 rows x 4 columns]

In [79]:
df.mortality.mean(), df.mortality.std(ddof=1) / np.sqrt(df.mortality.count())

(1524.1475409836066, 24.028521714278174)

In [81]:
d = norm(df.mortality.mean(), df.mortality.std(ddof=1) / np.sqrt(df.mortality.count()))
alpha = 0.05

d.ppf(alpha/2) , d.ppf(1-alpha/2)

(1477.0525038218827, 1571.2425781453305)

In [82]:
from statsmodels.stats.weightstats import _tconfint_generic
n = len(df.mortality.values)
print("95% confidence interval:", _tconfint_generic(df.mortality.values.mean(), 
                                                    df.mortality.values.std(ddof=1) / np.sqrt(n),
                                                    dof = n-1,
                                                    alpha=0.05,
                                                    alternative = 'two-sided'))

95% confidence interval: (1476.0833413552848, 1572.2117406119285)

In [83]:
south_df = df[df['location'] == 'South']
south_df.head()

   location         town  mortality  hardness
0     South         Bath       1247       105
2     South   Birmingham       1466         5
7     South  Bournemouth       1299        78
9     South     Brighton       1359        84
10    South      Bristol       1392        73

In [84]:
d = norm(south_df.mortality.mean(), south_df.mortality.std(ddof=1) / np.sqrt(south_df.mortality.count()))
alpha = 0.05

d.ppf(alpha/2), d.ppf(1-alpha/2)/100000

(1322.8909479237761, 0.014307244366916086)

In [95]:
from statsmodels.stats.weightstats import _tconfint_generic
n = len(south_df.mortality.values)
print("95% confidence interval:", _tconfint_generic(south_df.mortality.values.mean(), 
                                                    south_df.mortality.values.std(ddof=1) / np.sqrt(n),
                                                    dof = n-1,
                                                    alpha=0.05,
                                                    alternative = 'two-sided'))

95% confidence interval: (1320.1517462936238, 1433.463638321761)

In [85]:
north_df = df[df['location'] == 'North']
north_df.head()

  location        town  mortality  hardness
1    North  Birkenhead       1668        17
3    North   Blackburn       1800        14
4    North   Blackpool       1609        18
5    North      Bolton       1558        10
6    North      Bootle       1807        15

In [86]:
d = norm(north_df.mortality.mean(), north_df.mortality.std(ddof=1))
alpha = 0.05

d.ppf(alpha/2), d.ppf(1-alpha/2)

(1365.2085859077085, 1901.9914140922913)

In [87]:
np.mean(df.mortality.values), st.sem(df.mortality.values)

(1524.1475409836066, 24.028521714278174)

In [88]:
st.norm.interval(alpha=0.95, loc=np.mean(df.mortality.values), scale=st.sem(df.mortality.values, ddof=1))

(1477.0525038218827, 1571.2425781453305)

In [89]:
st.norm.interval(alpha=0.95, loc=np.mean(south_df.mortality.values), scale=st.sem(south_df.mortality.values))

(1322.8909479237761, 1430.7244366916086)

In [90]:
st.norm.interval(alpha=0.95, loc=np.mean(north_df.mortality.values), scale=st.sem(north_df.mortality.values))

(1588.2335708894593, 1678.9664291105405)

# Hardness

In [91]:
d = norm(south_df.hardness.mean(), south_df.hardness.std(ddof=1))
alpha = 0.05

d.ppf(alpha/2), d.ppf(1-alpha/2)

(-9.336251465215284, 148.8747130036768)

In [92]:
d = norm(north_df.hardness.mean(), north_df.hardness.std(ddof=1))
alpha = 0.05

d.ppf(alpha/2), d.ppf(1-alpha/2)

(-20.822666546825474, 81.62266654682546)

In [93]:
st.norm.interval(alpha=0.95, loc=np.mean(south_df.hardness.values), scale=st.sem(south_df.hardness.values))

(54.255369325168935, 85.2830922132926)

In [94]:
st.norm.interval(alpha=0.95, loc=np.mean(north_df.hardness.values), scale=st.sem(north_df.hardness.values))

(21.741789085882083, 39.058210914117915)